#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<string.h>
//int main()
//{
//	int a;
//	scanf_s("%d", &a);//"%d"无需换行（即无需写成"%d\n"的形式，此形式需要两次输入数值才会得到结果
//	int b = a / 2;
//	if (b%2==1)
//	{
//		printf("奇数\n");
//	}
//	else
//	{
//		printf("偶数\n");
//	}
//	return 0;
//}

//操作符——位移操作符
//int main()
//{
//	int a = 16;
//	/*int b = a >> 1*/;//左移操作符——移动的是二进制位//8
//	//000000000000000000010000
//	//000000000000000000001000
//	int b = a >> 2;//4
//	//000000000000000000010000
//	//000000000000000000000100
//	printf("%d\n", b);
//	return 0;
//}
//对于位移运算符，不要移动负数位，这个是标准未定义的
/*int num = 10;
num >> -1;*///err
//int main()
//{
//	//int a = -1;
//	//int b = a >> 1;//-1
//	//整数的二进制表示有：原码 反码 补码
//	//存储到内存的是补码
//	int a = 5;
//	int b = a << 1;//10
//	printf("%d\n", b);
//		return 0;
//}

//算数操作符
//+ - * % /
//int main()
//{
//	int a = 5 / 2;//商2余1 //a=2
//	int a = 5 % 2;//商2余1 //a=1
//	printf("a=%d\n", a);
//	return 0;
//}

//位移操作符
// &——按位与  |——按位或  ^——按位异或  （它们的操作数必须是整数
//int main()
//{
//	int a = 3;
//	int b = 5;
//	// &——按二进制位与（相同为1，相异为0
//	//int c = a & b; //1
//	// |——按二进制位或（有1即为1
//	//int c = a | b; //5
//	// &——按二进制位与（相同为0，相异为1
//	/*int c = a^ b;*/ //6
//	printf("%d\n", c);
//	return 0;
//}

//不能创建临时变量（第三个变量），实现两个数的交换
//1.创建变量
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//2.加减法——可能会溢出
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//	//得：before:a=5 b=3
//	//3.异或的方法 
//	/*a = a^ b;
//	b = a ^ b;
//	a = a ^ b;*/
//	//得：before:a=5 b=3
//	//int tmp = 0;//临时变量
//	printf("before:a=%d b=%d\n", a, b);//before:a=3 b=5
//	//tmp = a;
//	//a = b;
//	//b = tmp;
//	//printf("after:a=%d b=%d\n", a, b);//after:a=5 b=3
//	return 0;
//}